package set

var Headlogo string = `
++++++++++++++++++++++++++++++++++++++++++++++++++++
`
var Logo string = `
__    __  ________  __    __  ________  _______  
/  |  /  |/        |/  |  /  |/        |/       \ 
$$ |  $$ |$$$$$$$$/ $$ | /$$/ $$$$$$$$/ $$$$$$$  |
$$ |__$$ |$$ |__    $$ |/$$/  $$ |__    $$ |__$$ |
$$    $$ |$$    |   $$  $$<   $$    |   $$    $$/ 
$$$$$$$$ |$$$$$/    $$$$$  \  $$$$$/    $$$$$$$/  
      $$ |$$ |_____ $$ |$$  \ $$ |_____ $$ |      
      $$ |$$       |$$ | $$  |$$       |$$ |      
      $$/ $$$$$$$$/ $$/   $$/ $$$$$$$$/ $$/       
`
var Sublogo string = `
+++++++++++++++++++++++++++++++++++++++++++++++++++
+     Система учета рабочего времени  вер:1.0     +
+++++++++++++++++++++++++++++++++++++++++++++++++++
`

var Acces string = `
+++++++++++++++++++++++++++++++++++++++++++++++++++
+                 ДОСТУП РАЗРЕШЕН                 +
+                 для номера карты                +
+++++++++++++++++++++++++++++++++++++++++++++++++++
`
var AccesDenied string = `
+++++++++++++++++++++++++++++++++++++++++++++++++++
+                 ДОСТУП ЗАПРЕЩЕН                 +
+                 для номера карты                +
+++++++++++++++++++++++++++++++++++++++++++++++++++
`

var Descr string = `
+++++++++++++++++++++++++++++++++++++++++++++++++++
+                                                 +
+           ДЛЯ ФИКСАЦИИ РАБОЧЕГО ВРЕМЕНИ         +
+           КОСНИТЕСЬ КАРТОЙ СЧИТЫВАТЕЛЯ          +
+                                                 +   
+++++++++++++++++++++++++++++++++++++++++++++++++++
`
var DescrSettings string = `
+++++++++++++++++++++++++++++++++++++++++++++
+     ВЫ НАХОДИТЕСЬ В МЕНЮ НАСТРОЙКИ ДЛЯ    +
+ ПРОДОЛЖЕНИЯ РАБОТЫ ВЫБЕРИТЕ ИНТЕРЕСУЮЩИЙ  +
+              ВАС ПУНКТ МЕНЮ               +
+++++++++++++++++++++++++++++++++++++++++++++

+++++++++++++++++++ МЕНЮ ++++++++++++++++++++ 
1. 	Добавить нового сотрудника
2. 	Удалить сотрудника
3. 	Редактировать сотрудника
4. 	Вывести список сотрудников
5. 	Вывести журнал присутсвующих сейчас
6. 	Настройки подключения к БД
7. 	Очистка БД
8. 	Бэкап БД
9. 	Создать суперпользователя
10. 	Редактировать суперпользователя
11. 	Удалить суперпользователя
12. 	Показать список суперпользователей
13. 	Определить ключ доступа к телеграм боту
`

var (
	ResetColor string = "\033[0m"
	Red        string = "\033[31m"
	Green      string = "\033[32m"
	Yellow     string = "\033[33m"
	Blue       string = "\033[34m"
	Purple     string = "\033[35m"
	Cyan       string = "\033[36m"
	White      string = "\033[37m"
)

var TokenFile = "/home/lastart/bot_token.json"
var ExcelFile = "./export.xlsx"

var (
	ERROR_SEND_BOT    string = Red + "ОШИБКА ОТПРАВКИ СООБЩЕНИЯ БОТУ: " + ResetColor
	ERROR_TOKEN       string = Red + "ОШИБКА ПОЛУЧЕНИЯ ТОКЕНА: " + ResetColor
	BAD_ADMIN_ACCESS  string = Red + "НЕВЕРНЫЙ КОД ДОСТУПА" + ResetColor
	ERROR_INPUT       string = Red + "ОШИБКА ВВОДА. НЕКОРРЕКТНЫЕ ДАННЫЕ" + ResetColor
	ERROR_INSERT_TODB string = Red + "ОШИБКА ЗАПИСИ В БАЗУ ДАННЫХ: " + ResetColor
)
